src/cf/InformationRegisters/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБанковскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыИнтеграцииСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыИнтеграцииСБанком</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовИнтеграцииСБанком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияБанковскихДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСостояниеДокумента(Документ, СостояниеДокумента, ПереходСРедакции20 = Ложь) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Организация, Проведен");
		Ссылка			 = Документ;
		Организация		 = РеквизитыДокумента.Организация;
		ДокументПроведен = РеквизитыДокумента.Проведен;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ПлатежноеПоручение") Тогда
		
		Ссылка			 = Документ.Ссылка;
		ДокументПроведен = Документ.Проведен;
		Организация		 = Документ.Организация;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(СостояниеДокумента) = Тип("Строка") Тогда
		
		Если СостояниеДокумента = "Подготовлено" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Подготовлено;
			
		ИначеЕсли СостояниеДокумента = "НаПодписи" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.НаПодписи;
			
		ИначеЕсли СостояниеДокумента = "Отклонено" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Отклонено;
			
		ИначеЕсли СостояниеДокумента = "Отправлено" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Отправлено;
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияБанковскихДокументов.Организация,
	|	СостоянияБанковскихДокументов.СсылкаНаОбъект,
	|	СостоянияБанковскихДокументов.Состояние
	|ПОМЕСТИТЬ ВТСостоянияБанковскихДокументов
	|ИЗ
	|	РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
	|ГДЕ
	|	СостоянияБанковскихДокументов.СсылкаНаОбъект = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСостоянияБанковскихДокументов.Организация,
	|	ВТСостоянияБанковскихДокументов.СсылкаНаОбъект
	|ИЗ
	|	ВТСостоянияБанковскихДокументов КАК ВТСостоянияБанковскихДокументов
	|ГДЕ
	|	ВТСостоянияБанковскихДокументов.Организация <> &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСостоянияБанковскихДокументов.Организация,
	|	ВТСостоянияБанковскихДокументов.СсылкаНаОбъект,
	|	ВТСостоянияБанковскихДокументов.Состояние
	|ИЗ
	|	ВТСостоянияБанковскихДокументов КАК ВТСостоянияБанковскихДокументов
	|ГДЕ
	|	ВТСостоянияБанковскихДокументов.Организация = &Организация";
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Удаляем запись регистра, если в уже проведенном документе изменили организацию.
	Если Не Результат[1].Пустой() Тогда
		
		Выборка = Результат[1].Выбрать();
		Выборка.Следующий();
		
		ЗаписьРегистра = СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Организация		 = Выборка.Организация;
		ЗаписьРегистра.СсылкаНаОбъект	 = Выборка.СсылкаНаОбъект;
		ЗаписьРегистра.Удалить();
		
	КонецЕсли;
	
	Если Не Результат[2].Пустой() Тогда // уже есть записи в регистре сведений
		
		Выборка = Результат[2].Выбрать();
		Выборка.Следующий();
		Если Выборка.Состояние <> СостояниеДокумента И СостояниеДокумента <> Неопределено Тогда // если состояние не изменилось, регистр не перезаписываем
			
			ЗаписатьСостояние(Ссылка, Организация, СостояниеДокумента);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СостояниеДокумента) Тогда // еще нет записей в регистре, записываем, если состояние указано
		
		ЗаписатьСостояние(Ссылка, Организация, СостояниеДокумента);
		
	ИначеЕсли ДокументПроведен Тогда // если документ проведен, устанавливаем состояние "Подготовлено"
		
		ЗаписатьСостояние(Ссылка, Организация, Перечисления.СостоянияБанковскихДокументов.Подготовлено);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекущееСостояниеДокумента(ДокументСсылка) Экспорт
	
	Если ДокументСсылка.Пустая() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияБанковскихДокументов.Состояние
	|ИЗ
	|	РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
	|ГДЕ
	|	СостоянияБанковскихДокументов.СсылкаНаОбъект = &СсылкаНаОбъект";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Состояние;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйИнтерфейс

Процедура ЗаписатьСостояние(СсылкаНаОбъект, Организация, СостояниеДокумента)
	
	ЗаписьРегистра = СоздатьМенеджерЗаписи();
	ЗаписьРегистра.СсылкаНаОбъект = СсылкаНаОбъект;
	ЗаписьРегистра.Организация    = Организация;
	ЗаписьРегистра.Состояние      = СостояниеДокумента;
	ЗаписьРегистра.Записать();
	
	Если СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Оплачено Тогда
		РегистрыСведений.ДокументыИнтеграцииСБанком.УстановитьСостояниеОбменЗавершен(СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
